# Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии
# Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел,
# разделенных пробелом и снова нажать Enter. Сумма вновь введенных чисел будет
# добавляться к уже подсчитанной сумме. Но если вместо числа вводится специальный символ,
# выполнение программы завершается. Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить
# программу.

def sum_of_str(some_str):
    my_list = some_str.split()
    my_list = list(map(int, my_list))
    return sum(my_list)

all_item_sum = 0

while True:
    my_str = input('Вводите числа разделяя пробелом (для завершения введите Q):')
    if my_str.count("Q") > 0:
        my_str = my_str[:len(my_str)-1]
        #print(my_str)
        all_item_sum += sum_of_str(my_str)
        print("Программа завершена. Итоговая сумма: ", all_item_sum)
        quit()
    all_item_sum += sum_of_str(my_str)
    print("Cумма: ", all_item_sum)
